# Homebrew packages (brew)
brew "asdf"
brew "bat"
brew "bats-core"
brew "diff-so-fancy"
brew "direnv"
brew "entr"
brew "eslint"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "hub"
brew "imagemagick"
brew "markdownlint-cli2"
brew "mas"  # Required for Mac App Store apps
brew "prettier"
brew "pure"
brew "qpdf"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "thefuck"
brew "uv"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh"

# Homebrew casks
cask "1password-cli"
cask "arc"
cask "caffeine"
cask "codex"
cask "cursor"
cask "docker-desktop"
cask "elgato-stream-deck"
cask "flux-app"
cask "google-drive"
cask "hazel"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "libreoffice"
cask "lm-studio"
cask "mailmate"
cask "mos"
cask "mutedeck"
cask "obsidian"
cask "raycast"
cask "renamer"
cask "sf-symbols"
cask "shottr"
cask "spotify"
cask "textbuddy"
cask "visual-studio-code"

# VSCode extensions
vscode "anthropic.claude-code"
vscode "batisteo.vscode-django"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "gamunu.vscode-yarn"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "github.vscode-github-actions"
vscode "jetmartin.bats"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "charliermarsh.ruff"
vscode "mikestead.dotenv"
vscode "ms-python.python"
vscode "openai.chatgpt"
vscode "swiftlang.swift-vscode"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "waderyan.gitblame"
vscode "wmaurer.change-case"

# Mac App Store apps
mas "Amphetamine", id: 937984704
mas "CARROTweather", id: 993487541
mas "Meeter", id: 1510445899
mas "Rapidmg", id: 6451349778
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696

# Apps requiring sudo for upgrades are in sudo.Brewfile
