# VSCode extensions
vscode "anthropic.claude-code"
vscode "batisteo.vscode-django"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "gamunu.vscode-yarn"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "github.vscode-github-actions"
vscode "jetmartin.bats"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "charliermarsh.ruff"
vscode "mikestead.dotenv"
vscode "ms-python.python"
vscode "openai.chatgpt"
vscode "swiftlang.swift-vscode"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "waderyan.gitblame"
vscode "wmaurer.change-case"
