# Homebrew packages (brew)
brew "asdf"
brew "bat"
brew "diff-so-fancy"
brew "direnv"
brew "eza"
brew "gifsicle"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "hub"
brew "imagemagick"
brew "mas"  # Required for Mac App Store apps
brew "pure"
brew "pyenv"
brew "thefuck"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"

# Homebrew casks
cask "1password-cli"
cask "arc"
cask "caffeine"
cask "cardhop"
cask "cursor"
cask "dropbox"
cask "elgato-stream-deck"
cask "flux"
cask "google-drive"
cask "hazel"
cask "iterm2"
cask "jordanbaird-ice"
cask "keyboard-maestro"
cask "mos"
cask "obsidian"
cask "raycast"
cask "renamer"
cask "shottr"
cask "spotify"
cask "superhuman"
cask "textbuddy"
cask "visual-studio-code"

# Mac App Store apps
mas "CARROTweather", id: 993487541
mas "Meeter", id: 1510445899
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Toolkit for YNAB", id: 1592912837 

# Let's try to not use these, see if Raycast is worth it
# cask "moom"
# cask "karabiner-elements"
# cask "alfred"