# Homebrew packages (brew)
brew "asdf"
brew "diff-so-fancy"
brew "gh"
brew "git"
brew "hub"
brew "imagemagick"
brew "mas"  # Required for Mac App Store apps
brew "pure"
brew "pyenv"
brew "thefuck"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"

# Homebrew casks
cask "1password-cli"
cask "alfred"
cask "arc"
cask "caffeine"
cask "cardhop"
cask "docker"
cask "dropbox"
cask "elgato-stream-deck"
cask "flux"
cask "font-hack-nerd-font"
cask "font-monoid"
cask "google-drive"
cask "hazel"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "moom"
cask "mos"
cask "obsidian"
cask "spotify"
cask "superhuman"
cask "visual-studio-code"

# Mac App Store apps
mas "Meeter", id: 1510445899
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696 